교재 - 파이썬 한권으로 끝내기 : 데이터분석전문가(ADP) + 빅데이터분석기사 실기대비

## Part-1 : 시험소개 및 환경구성

1. 머신러닝
- 시각화를 포함한 탐색적 자료분석을 수행하라
- 결측치를 식별한 뒤 결측치를 예측하는 두 가지 방법을 적용하고 해당 방법을 선택한 이유를 설명하라
- 범주형 변수 인코딩이 필요한 경우를 식별한 뒤 데이터 변환을 적용하고 해당 방법을 선택한 이유를 설명하라
- 데이터 분할 방법 2가지를 쓰고 적절한 데이터 분할을 적용한 뒤 해당 방법을 선택한 이유를 설명하라
- SVM, XGBoost, RandomForeset 알고리즘의 공통점을 쓰고 해당 데이터세트에 대한 예측 분석에 적합한 알고리즘을 설명하라
- 세가지 모델링을 모든 수행한 뒤 가장 적합한 알고리즘을 선택하라. 해당 알고리즘을 선택한 이유와 한계점, 보완 가능한 부분, 현업에서 사용 시 주의할 점에 대해 서술하라.

2. 통계분석
- 연속형 독립변수를 가진 데이터세트로 아래의 조건에 따라 분석을 수행하시오.  
-1. 데이터를 8:2로 분할하고 선형 회귀를 적용한 뒤 결정계수와 RMSE를 구하라.  
-2. 데이터를 8:2로 분할하고 릿지 회귀를 적용하라. 알파값을 0부터 1까지 0.1단위로 모두 탐색해서 결정계수가 가장 높을 때의 알파를 찾고, 해당 알파고 다시 모델을 학습해서 결정계수와 RMSE를 계산하라  
-3. 라쏘 회귀로 -2와 동일한 과정을 수행하라  

- 주어진 데이터로 다항 회귀를 수행하라  
-1. 다항 회귀를 3차까지 적용하고 각 차수별 데이터포인트 스캐터 플롯과 계수와 기울기선을 그려라  

- ANOVA 분석  
-1. 범주형 변수 하나와 연속형 변수 두 가지를 포함한 데이터로 이원분산분석을 수행하고 통계표를 작성하라

## Part-2 : 데이터 핸들링

Pandas 사용준비

In [2]:
import pandas as pd
import numpy as np

DataFrame 선언하기

In [13]:
dataset = np.array([['kor',70], ['math',80]]) # 교재와 다름 
df = pd.DataFrame(dataset, columns=['class','score'])

In [14]:
dataset

array([['kor', '70'],
       ['math', '80']], dtype='<U21')

In [15]:
df

  class score
0   kor    70
1  math    80

DataFrame 읽고 저장하기

In [16]:
# from sklearn.datasets import load_iris
# iris = load_iris()
# iris = pd.DataFrame(iris.data, columns = iris.feature_names)
# iris.to_csv('data.csv')

In [17]:
filepath= 'dataset/data.csv'
data = pd.read_csv(filepath, na_values='NA', encoding='utf8')

In [18]:
data.to_csv('result.csv', header=True, index=True, encoding='utf8')

DataFrame 출력

In [72]:
from sklearn.datasets import load_iris
iris = load_iris()
iris = pd.DataFrame(iris.data, columns = iris.feature_names)
iris

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [20]:
iris.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [21]:
iris.tail()

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

DataFrame 요약, 통계정보 확인하기

In [22]:
pd.set_option('display.max_columns', None) # 모든 열 출력
pd.set_option('display.max_rows', None) # 모든 행 출력

In [23]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   sepal length (cm)  150 non-null    float64
 1   sepal width (cm)   150 non-null    float64
 2   petal length (cm)  150 non-null    float64
 3   petal width (cm)   150 non-null    float64
dtypes: float64(4)
memory usage: 4.8 KB

In [24]:
iris.describe()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.057333,3.758000,1.199333
std,0.828066,0.435866,1.765298,0.762238
min,4.300000,2.000000,1.000000,0.100000
25%,5.100000,2.800000,1.600000,0.300000
50%,5.800000,3.000000,4.350000,1.300000
75%,6.400000,3.300000,5.100000,1.800000
max,7.900000,4.400000,6.900000,2.500000

DataFrame 인덱스 확인 추가 리셋

In [25]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [26]:
df.columns

Index(['class', 'score'], dtype='object')

In [27]:
list(df.index)

[0, 1]

In [28]:
df.index=['A','B']

In [29]:
df.index

Index(['A', 'B'], dtype='object')

In [30]:
df

  class score
A   kor    70
B  math    80

In [31]:
df.set_index('class', drop=True,append=False, inplace=True)
df

      score
class
kor      70
math     80

In [32]:
df.reset_index(drop=False,inplace=True)
df

  class score
0   kor    70
1  math    80

DataFrame 컬럼명 확인 및 변경

In [33]:
iris.columns

Index(['sepal length (cm)', 'sepal width (cm)', 'petal length (cm)',
       'petal width (cm)'],
      dtype='object')

In [34]:
iris.columns = ['sepal length','sepal width', 'petal length', 'petal width']
iris.head(3)

   sepal length  sepal width  petal length  petal width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2

In [35]:
iris.columns = iris.columns.str.replace(' ','_')
iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2

DataFrame 컬럼의 데이터 타입 확인 및 변경

In [36]:
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
dtype: object

In [37]:
iris['sepal_length'] = iris['sepal_width'].astype('int')
iris[['sepal_width','petal_length']] = \
iris[['sepal_width', 'petal_length']].astype('int')
iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width
0             3            3             1          0.2
1             3            3             1          0.2
2             3            3             1          0.2

In [38]:

iris.dtypes

sepal_length      int64
sepal_width       int64
petal_length      int64
petal_width     float64
dtype: object

Row/column 선택

In [40]:
from sklearn.datasets import load_iris
iris=load_iris()
iris = pd.DataFrame(iris.data,columns=iris.feature_names)
iris[1:4]

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2

In [41]:
iris['sepal length (cm)'].head(4)

0    5.1
1    4.9
2    4.7
3    4.6
Name: sepal length (cm), dtype: float64

In [43]:
iris[['sepal length (cm)','sepal width (cm)']].head(4)

   sepal length (cm)  sepal width (cm)
0                5.1               3.5
1                4.9               3.0
2                4.7               3.2
3                4.6               3.1

iloc

In [44]:
iris.iloc[1:4]

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2

In [45]:
iris.iloc[[1,3,5],2:4]

   petal length (cm)  petal width (cm)
1                1.4               0.2
3                1.5               0.2
5                1.7               0.4

In [51]:
iris.iloc[:,[True,True,False,True]]

     sepal length (cm)  sepal width (cm)  petal width (cm)
0                  5.1               3.5               0.2
1                  4.9               3.0               0.2
2                  4.7               3.2               0.2
3                  4.6               3.1               0.2
4                  5.0               3.6               0.2
..                 ...               ...               ...
145                6.7               3.0               2.3
146                6.3               2.5               1.9
147                6.5               3.0               2.0
148                6.2               3.4               2.3
149                5.9               3.0               1.8

[150 rows x 3 columns]

loc

In [52]:
iris.loc[1:3]

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2

In [53]:
iris.loc[[1,2],'sepal length (cm)':'petal length (cm)']

   sepal length (cm)  sepal width (cm)  petal length (cm)
1                4.9               3.0                1.4
2                4.7               3.2                1.3

In [65]:
score = pd.DataFrame({'국어':[100,80],'수학':[75,90],'영어':[90,95]},index=['장화','홍련'])
score.loc['홍련','영어'] = 100
score['국어'] = score['국어'] - 5
score

    국어  수학   영어
장화  95  75   90
홍련  75  90  100

row/column 추가

In [66]:
new_students = pd.DataFrame({'국어':[70,85],'수학':[65,100],'영어':[95,65]}, index=['콩쥐','팥쥐'])
score = score.append(new_students)
new_student1 = pd.Series({'국어':85, '수학':55,'영어':95}, name='해님')
score = score.append(new_student1)
score

/tmp/ipykernel_1980405/756765724.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  score = score.append(new_students)
/tmp/ipykernel_1980405/756765724.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  score = score.append(new_student1)

    국어   수학   영어
장화  95   75   90
홍련  75   90  100
콩쥐  70   65   95
팥쥐  85  100   65
해님  85   55   95

In [69]:
new_student2 = {'국어':75, '수학':80, '영어':80}
score.append(new_student2, ignore_index=True)

/tmp/ipykernel_1980405/240250354.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  score.append(new_student2, ignore_index=True)

   국어   수학   영어
0  95   75   90
1  75   90  100
2  70   65   95
3  85  100   65
4  85   55   95
5  75   80   80

In [70]:
science = [80,70,90,85,75]
score['과학'] = science
score['학년'] = 1
score

    국어   수학   영어  과학  학년
장화  95   75   90  80   1
홍련  75   90  100  70   1
콩쥐  70   65   95  90   1
팥쥐  85  100   65  85   1
해님  85   55   95  75   1

In [71]:
score['과학'] = score['과학'] + 5
score['총점'] = score['국어']  + score['수학'] + score['영어'] + score['과학']
score

    국어   수학   영어  과학  학년   총점
장화  95   75   90  85   1  345
홍련  75   90  100  75   1  340
콩쥐  70   65   95  95   1  325
팥쥐  85  100   65  90   1  340
해님  85   55   95  80   1  315

row/columns 삭제

In [76]:
score.drop('장화',inplace=True)
score.drop(columns=['과학','학년','총점'])

    국어   수학   영어
홍련  75   90  100
콩쥐  70   65   95
팥쥐  85  100   65
해님  85   55   95

조건에 맞는 데이터 탐색 및 수정

In [77]:
students = pd.DataFrame({'이름':['장화','홍련','콩주','팥쥐','해님','달님'],
                            '국어':[70,85,None,100,None,85],
                            '수학':[65,100,80,95,None,70]})
students[students['이름']=='장화']

   이름    국어    수학
0  장화  70.0  65.0

In [78]:
students[(students['국어']>=80) & (students['수학']>=80)]

   이름     국어     수학
1  홍련   85.0  100.0
3  팥쥐  100.0   95.0

In [79]:
students.loc[6,'이름':'수학'] = ['별님',50,60]
students.loc[(students['국어']>=80) & (students['수학']>=70),'합격'] = 'Pass'
students.loc[students['합격']!='Pass','합격'] ='Fail'
students

   이름     국어     수학    합격
0  장화   70.0   65.0  Fail
1  홍련   85.0  100.0  Pass
2  콩주    NaN   80.0  Fail
3  팥쥐  100.0   95.0  Pass
4  해님    NaN    NaN  Fail
5  달님   85.0   70.0  Pass
6  별님   50.0   60.0  Fail

np.select()

- 데이터 프레임 or 리스트 내 필드에 접근하고 수정하는 방법
- 조건 목록과 선택 목록을 입력으로 받아서 조건에 따라 선택 목록의 요소로 구성된 배열을 반환한다.
- 이 방법을 사용하면 두 개 이상의 조건이 있을 때 pandas의 주어진 조건을 기반으로 DataFrame 열을 만들 수 있다.

In [83]:
condition_list = [(students['국어']>=90),(students['국어']>=80) & (students['국어']<90), (students['국어']>=70) & (students['국어']<80)]
choice_list = ['A','B','C']
students['점수'] = np.select(condition_list, choice_list,default='F')
students

   이름     국어     수학    합격 점수
0  장화   70.0   65.0  Fail  C
1  홍련   85.0  100.0  Pass  B
2  콩주    NaN   80.0  Fail  F
3  팥쥐  100.0   95.0  Pass  A
4  해님    NaN    NaN  Fail  F
5  달님   85.0   70.0  Pass  B
6  별님   50.0   60.0  Fail  F

결측값 탐색 및 수정

In [86]:
students.isna().sum()

이름    0
국어    2
수학    1
합격    0
점수    0
dtype: int64

In [87]:
students.isna().sum(1)

0    0
1    0
2    1
3    0
4    2
5    0
6    0
dtype: int64

In [88]:
#결측값 제거 
students.dropna()

   이름     국어     수학    합격 점수
0  장화   70.0   65.0  Fail  C
1  홍련   85.0  100.0  Pass  B
3  팥쥐  100.0   95.0  Pass  A
5  달님   85.0   70.0  Pass  B
6  별님   50.0   60.0  Fail  F

In [89]:
students.dropna(thresh=4)

   이름     국어     수학    합격 점수
0  장화   70.0   65.0  Fail  C
1  홍련   85.0  100.0  Pass  B
2  콩주    NaN   80.0  Fail  F
3  팥쥐  100.0   95.0  Pass  A
5  달님   85.0   70.0  Pass  B
6  별님   50.0   60.0  Fail  F

In [98]:
# 결측값 대체
health = pd.DataFrame({'연도': [2017,2018,2019,2020,2021,2022],
                        '키': [160,162,165,None,None,166],
                        '몸무게':[53,52,None,50,51,54],
                        '시력':[1.2,None,1.2,1.2,1.1,0.8],
                        '병결': [None,None,None,2,None,1]
                        })
health.fillna(0)

     연도      키   몸무게   시력   병결
0  2017  160.0  53.0  1.2  0.0
1  2018  162.0  52.0  0.0  0.0
2  2019  165.0   0.0  1.2  0.0
3  2020    0.0  50.0  1.2  2.0
4  2021    0.0  51.0  1.1  0.0
5  2022  166.0  54.0  0.8  1.0

In [99]:
health.fillna(health.mean())

     연도       키   몸무게   시력   병결
0  2017  160.00  53.0  1.2  1.5
1  2018  162.00  52.0  1.1  1.5
2  2019  165.00  52.0  1.2  1.5
3  2020  163.25  50.0  1.2  2.0
4  2021  163.25  51.0  1.1  1.5
5  2022  166.00  54.0  0.8  1.0

In [101]:
health['병결'] = health['병결'].fillna(0)
health['몸무게'] = health['몸무게'].fillna(health['몸무게'].mean())
health

     연도      키   몸무게   시력   병결
0  2017  160.0  53.0  1.2  0.0
1  2018  162.0  52.0  NaN  0.0
2  2019  165.0  52.0  1.2  0.0
3  2020    NaN  50.0  1.2  2.0
4  2021    NaN  51.0  1.1  0.0
5  2022  166.0  54.0  0.8  1.0

In [102]:
health.fillna(method='pad', inplace=True)
health

     연도      키   몸무게   시력   병결
0  2017  160.0  53.0  1.2  0.0
1  2018  162.0  52.0  1.2  0.0
2  2019  165.0  52.0  1.2  0.0
3  2020  165.0  50.0  1.2  2.0
4  2021  165.0  51.0  1.1  0.0
5  2022  166.0  54.0  0.8  1.0

In [103]:
# 중복행 삭제
health['키'].drop_duplicates()

0    160.0
1    162.0
2    165.0
5    166.0
Name: 키, dtype: float64

In [104]:
set(health['키'])

{160.0, 162.0, 165.0, 166.0}

In [105]:
health[['시력','병결']].drop_duplicates()

    시력   병결
0  1.2  0.0
3  1.2  2.0
4  1.1  0.0
5  0.8  1.0

데이터 정렬

In [107]:
from sklearn.datasets import load_iris
iris=load_iris()
iris = pd.DataFrame(iris.data,columns=iris.feature_names)
iris.sort_index(ascending=False, inplace=True)
iris.head()

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
149                5.9               3.0                5.1               1.8
148                6.2               3.4                5.4               2.3
147                6.5               3.0                5.2               2.0
146                6.3               2.5                5.0               1.9
145                6.7               3.0                5.2               2.3

In [108]:
iris.sort_index(axis=1, ascending= True, inplace= True)
iris.head()

     petal length (cm)  petal width (cm)  sepal length (cm)  sepal width (cm)
149                5.1               1.8                5.9               3.0
148                5.4               2.3                6.2               3.4
147                5.2               2.0                6.5               3.0
146                5.0               1.9                6.3               2.5
145                5.2               2.3                6.7               3.0

In [109]:
iris.sort_values('petal length (cm)')

     petal length (cm)  petal width (cm)  sepal length (cm)  sepal width (cm)
22                 1.0               0.2                4.6               3.6
13                 1.1               0.1                4.3               3.0
14                 1.2               0.2                5.8               4.0
35                 1.2               0.2                5.0               3.2
16                 1.3               0.4                5.4               3.9
..                 ...               ...                ...               ...
131                6.4               2.0                7.9               3.8
105                6.6               2.1                7.6               3.0
117                6.7               2.2                7.7               3.8
122                6.7               2.0                7.7               2.8
118                6.9               2.3                7.7               2.6

[150 rows x 4 columns]

In [110]:
iris.sort_values(['petal width (cm)', 'sepal length (cm)'])

     petal length (cm)  petal width (cm)  sepal length (cm)  sepal width (cm)
13                 1.1               0.1                4.3               3.0
12                 1.4               0.1                4.8               3.0
37                 1.4               0.1                4.9               3.6
9                  1.5               0.1                4.9               3.1
32                 1.5               0.1                5.2               4.1
..                 ...               ...                ...               ...
136                5.6               2.4                6.3               3.4
140                5.6               2.4                6.7               3.1
100                6.0               2.5                6.3               3.3
144                5.7               2.5                6.7               3.3
109                6.1               2.5                7.2               3.6

[150 rows x 4 columns]

데이터 결합

In [3]:
HR1 = pd.DataFrame({'이름':['장화','홍련'], '부서':['영업', '회계'],'직급':['팀장','사원']})
HR2 = pd.DataFrame({'이름': [ '콩쥐','팥쥐'],'직급':['사원','팀장'],'부서':['영업','인사']})
pd.concat([HR1,HR2],axis=0)

   이름  부서  직급
0  장화  영업  팀장
1  홍련  회계  사원
0  콩쥐  영업  사원
1  팥쥐  인사  팀장

In [4]:
pd.concat([HR1,HR2],axis=0, ignore_index=True)

   이름  부서  직급
0  장화  영업  팀장
1  홍련  회계  사원
2  콩쥐  영업  사원
3  팥쥐  인사  팀장

In [5]:
HR3 = pd.DataFrame({'이름':['콩쥐','팥쥐'], '부서':['영업','인사'],'급여':[3500,2800]})
pd.concat([HR1,HR3],axis=0,ignore_index=True)

   이름  부서   직급      급여
0  장화  영업   팀장     NaN
1  홍련  회계   사원     NaN
2  콩쥐  영업  NaN  3500.0
3  팥쥐  인사  NaN  2800.0

In [6]:
HR4 = pd.Series({1:2500}, name='급여')
pd.concat([HR1,HR4], axis=1)

   이름  부서  직급      급여
0  장화  영업  팀장     NaN
1  홍련  회계  사원  2500.0

In [10]:
HR5 = pd.DataFrame({'급여':[4500,3000,3500]})
pd.concat([HR1,HR5], axis=1)

    이름   부서   직급    급여
0   장화   영업   팀장  4500
1   홍련   회계   사원  3000
2  NaN  NaN  NaN  3500

In [13]:
product = pd.DataFrame({'상품코드':['G1','G2','G3','G4'],
                        '상품명': ['우유','감자','빵','치킨']})
sale = pd.DataFrame({'주문번호':[1001,1002,1002,1003,1004],
                    '상품코드':['G4','G3','G1','G3','G5'],
                    '주문수량':[1,4,2,2,3]})
sale.merge(product, on='상품코드', how='inner')

   주문번호 상품코드  주문수량 상품명
0  1001   G4     1  치킨
1  1002   G3     4   빵
2  1003   G3     2   빵
3  1002   G1     2  우유

In [14]:
sale.merge(product, on='상품코드',how='outer',sort=True)

     주문번호 상품코드  주문수량  상품명
0  1002.0   G1   2.0   우유
1     NaN   G2   NaN   감자
2  1002.0   G3   4.0    빵
3  1003.0   G3   2.0    빵
4  1001.0   G4   1.0   치킨
5  1004.0   G5   3.0  NaN

In [15]:
sale.merge(product, left_on='상품코드', right_on = '상품코드', how='left')

   주문번호 상품코드  주문수량  상품명
0  1001   G4     1   치킨
1  1002   G3     4    빵
2  1002   G1     2   우유
3  1003   G3     2    빵
4  1004   G5     3  NaN

데이터 요약

In [20]:
from sklearn.datasets import load_iris
IRIS=load_iris()
iris = pd.DataFrame(IRIS.data,columns=IRIS.feature_names)
iris['class'] = IRIS.target
iris['class'] = iris['class'].map({0:'setosa',1:'versicolor',2:'virginica'})
iris.groupby(by='class').mean()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
class,,,,
setosa,5.006,3.428,1.462,0.246
versicolor,5.936,2.770,4.260,1.326
virginica,6.588,2.974,5.552,2.026

In [23]:
iris.groupby(by='class').median()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
class,,,,
setosa,5.0,3.4,1.50,0.2
versicolor,5.9,2.8,4.35,1.3
virginica,6.5,3.0,5.55,2.0

In [24]:
iris.groupby(by='class').var()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
class,,,,
setosa,0.124249,0.143690,0.030159,0.011106
versicolor,0.266433,0.098469,0.220816,0.039106
virginica,0.404343,0.104004,0.304588,0.075433

도수 분포표

In [25]:
pd.Series(iris['class'].value_counts())

setosa        50
versicolor    50
virginica     50
Name: class, dtype: int64

pd.qcut()  
- 데이터의 분위수를 기준으로 구간을 나눠주는 함수

In [26]:
iris['petal width level'] = pd.qcut(iris['petal width (cm)'],q=3,labels=['short','middle','long'])
pd.Series(iris['petal width level']).value_counts().to_frame()

        petal width level
middle                 52
short                  50
long                   48

In [27]:
pd.crosstab(iris['petal width level'], iris['class'])

class              setosa  versicolor  virginica
petal width level
short                  50           0          0
middle                  0          48          4
long                    0           2         46

데이터 재구조화

In [30]:
score = {'학년':[1,1,1,1,2,2],
        '반':['A','A','B','B','C','C'],
        '성별':['여자','남자','여자','남자','여자','남자'],
        '성적':[76,88,85,72,68,70]}
score = pd.DataFrame(score)
score

   학년  반  성별  성적
0   1  A  여자  76
1   1  A  남자  88
2   1  B  여자  85
3   1  B  남자  72
4   2  C  여자  68
5   2  C  남자  70

In [31]:
score= score.pivot_table(index=['학년','반'], columns = '성별', values='성적')
score

성별    남자  여자
학년 반
1  A  88  76
   B  72  85
2  C  70  68

In [34]:
# melt
score.reset_index().melt(id_vars=['학년','반'], var_name='성별',value_name='성적')

   학년  반  성별  성적
0   1  A  남자  88
1   1  B  남자  72
2   2  C  남자  70
3   1  A  여자  76
4   1  B  여자  85
5   2  C  여자  68

데이터 프레임에 함수 적용하기

In [35]:
score.apply(np.sqrt, axis=0)

성별          남자        여자
학년 반
1  A  9.380832  8.717798
   B  8.485281  9.219544
2  C  8.366600  8.246211

In [36]:
score.apply(np.max, axis=0)

성별
남자    88
여자    85
dtype: int64

In [37]:
def plus_five(val):
    return val + 5
score.apply(plus_five)

성별    남자  여자
학년 반
1  A  93  81
   B  77  90
2  C  75  73

In [40]:
def class_avg(df):
    return np.ceil((df['남자']+ df['여자'])/2)
score.apply(class_avg,axis=1)

학년  반
1   A    82.0
    B    79.0
2   C    69.0
dtype: float64

In [41]:
score['남자'].apply(lambda x: x+5)

학년  반
1   A    93
    B    77
2   C    75
Name: 남자, dtype: int64

문자열 데이터 변환하기

In [43]:
landmark = pd.DataFrame({'name':['광화문','호미곶','첨성대'],
                        'location':['서울 종로구 사직로 161','경북 포항시 남구 호미곶면 대보리 150',
                        '경북 경주시 인왕동 839-1']})
landmark['location'].str[3:6]

0    종로구
1    포항시
2    경주시
Name: location, dtype: object

In [44]:
landmark['location'].str.split(" ", expand=True)

    0    1    2      3     4     5
0  서울  종로구  사직로    161  None  None
1  경북  포항시   남구   호미곶면   대보리   150
2  경북  경주시  인왕동  839-1  None  None

In [45]:
landmark['loc_1'] = landmark['location'].str.split(" ").str[0]

In [46]:
landmark

  name                location loc_1
0  광화문          서울 종로구 사직로 161    서울
1  호미곶  경북 포항시 남구 호미곶면 대보리 150    경북
2  첨성대        경북 경주시 인왕동 839-1    경북

In [47]:
landmark['location'].str.startswith('서울')

0     True
1    False
2    False
Name: location, dtype: bool

In [48]:
landmark['location'].str.endswith('1')

0     True
1    False
2     True
Name: location, dtype: bool

In [49]:
landmark['location'].str.contains('1')

0    True
1    True
2    True
Name: location, dtype: bool

날짜 데이터 핸들링

In [50]:
from datetime import datetime
datetime.today()

datetime.datetime(2025, 1, 10, 16, 14, 45, 367645)

In [51]:
datetime.today().year

2025

In [52]:
# df['Datetime'] = pd.to_datetime(df['Datetime'], format="%Y-%m-%d %H:%M:%S")

NameError: name 'df' is not defined

In [53]:
datetime.strptime('2022-01-01 00:00:00','%Y-%m-%d %H:%M:%S')

datetime.datetime(2022, 1, 1, 0, 0)

In [54]:
time = datetime.today()
time.strftime('%Y-%m-%d %H:%M:%S')

'2025-01-10 16:23:19'

In [58]:
from datetime import timedelta
time = datetime.today()
time + timedelta(days=100)

datetime.datetime(2025, 4, 20, 16, 24, 33, 297113)